<img src="Fireblaze__2___3_-removebg-preview.png" width=300 height=250 />

## Table of Content

1. **[Concatenate](#Concatenate)**
2. **[Merge](#Merge)**
3. **[Groupby](#Groupby)**
4. **[Aggregate Function](#Aggregate_function)**
5. **[Pivot & Pivot table ](#Pivot_&_Pivot_table)**
6. **[Crosstab](#Crosstab)**
7. **[Datetime module](#Datetime_module)**

### Let's begin with some hands-on practice exercises

<a id="Concatenate"> </a>
## <span style='color:Brown'> **1. Concatenate** </span>

### <span style='color:Blue'> **Question - 1.Create two DataFrame & concatenate them with respect to columns.** </span>

In [2]:
#write observation and code here
import pandas as pd

data1 = {'A':[1,2,3],'B':[4,5,6]}
df1 = pd.DataFrame(data1)
data2 = {'C':[7,8,9],'D':[10,11,12]}
df2 = pd.DataFrame(data2)
concatenated_df = pd.concat([df1, df2], axis=1)
concatenated_df

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

### <span style='color:Blue'> **Question - 2.Concatenate above DataFrame with respect to row".** </span>

In [3]:
#write observation and code here
data1 = {'A':[1,2,3],'B':[4,5,6]}
df1 = pd.DataFrame(data1)
data2 = {'C':[7,8,9],'D':[10,11,12]}
df2 = pd.DataFrame(data2)
concatenated_df = pd.concat([df1, df2])
concatenated_df

     A    B    C     D
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
0  NaN  NaN  7.0  10.0
1  NaN  NaN  8.0  11.0
2  NaN  NaN  9.0  12.0

<a id="Merge"> </a>
## <span style='color:Brown'> **2. Merge** </span>

### <span style='color:Blue'> **Question - 3.Create new two DataFrame & merge it using outer merge.** </span>

In [6]:
#write observation and code here
data3 = {'key':['A','B','C','D'],'Value1':[1,2,3,4]}
df1 = pd.DataFrame(data3)
data4 = {'key':['C','D','E','F'],'Value':[5,6,7,8]}
df2 = pd.DataFrame(data4)

merged_df = pd.merge(df1,df2,on='key' ,how='outer')
merged_df

  key  Value1  Value
0   A     1.0    NaN
1   B     2.0    NaN
2   C     3.0    5.0
3   D     4.0    6.0
4   E     NaN    7.0
5   F     NaN    8.0

<a id="Groupby"></a>
## <span style='color:Brown'> **3. Groupby** </span>

### <span style='color:Blue'> **Question - 4. Create a new DataFrame & Give some example to show how to make a groups.** </span>

In [9]:
#write observation and code here
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'C'],'Value': [10, 20, 15, 25, 12, 30]}
df = pd.DataFrame(data)
grouped = df.groupby('Category')


# Example: Calculate the mean value for each group
mean_values = grouped.mean()
print(mean_values)

# Example: Get the size of each group
group_sizes = grouped.size()
print(group_sizes)

              Value
Category
A         12.333333
B         22.500000
C         30.000000
Category
A    3
B    2
C    1
dtype: int64

In [10]:
# Example: Iterate through the groups and display their contents
for group_name, group_data in grouped:
    print(f'Group: {group_name}')
    print(group_data)
    print()

Group: A
  Category  Value
0        A     10
2        A     15
4        A     12

Group: B
  Category  Value
1        B     20
3        B     25

Group: C
  Category  Value
5        C     30

<a id="Aggregate_function"></a>
## <span style='color:Brown'> **4. Aggregate Function** </span>

### <span style='color:Blue'> **Question - 5.Perform aggregate function on above created groups**</span>

In [11]:
#write observation and code here
import pandas as pd

data = {'Category': ['A', 'B', 'A', 'B', 'A', 'C'],'Value': [10, 20, 15, 25, 12, 30]}
df = pd.DataFrame(data)

grouped = df.groupby('Category')

# aggregate functions on the groups
aggregate_result = grouped.agg({'Value': ['mean', 'sum', 'min', 'max', 'count']
})

print(aggregate_result)

              Value
               mean sum min max count
Category
A         12.333333  37  10  15     3
B         22.500000  45  20  25     2
C         30.000000  30  30  30     1

<a id="Pivot_&_Pivot_table"></a>
## <span style='color:Brown'> **5. Pivot & Pivot Table** </span>

### <span style='color:Blue'> **Question - 6.Load any one dataset from seaborn & Show how to use pivot function .** </span>

In [20]:
#write observation and code here
import seaborn as sns
import pandas as pd

# Load the Titanic dataset from Seaborn
titanic = sns.load_dataset('titanic')

# Display a few rows of the original dataset
print("Original Titanic Dataset:")
print(titanic.head())

Original Titanic Dataset:
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [19]:
# Load the "flights" dataset from Seaborn
flights = sns.load_dataset('flights')

# Display a few rows of the original dataset
print("Original Flights Dataset:")
print(flights.head())

# Use the pivot function to pivot the dataset
pivot_result = flights.pivot(index='month', columns='year', values='passengers')

print("\nPivoted Flights Dataset:")
print(pivot_result)

Original Flights Dataset:
   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

Pivoted Flights Dataset:
year   1949  1950  1951  1952  1953  1954  1955  1956  1957  1958  1959  1960
month
Jan     112   115   145   171   196   204   242   284   315   340   360   417
Feb     118   126   150   180   196   188   233   277   301   318   342   391
Mar     132   141   178   193   236   235   267   317   356   362   406   419
Apr     129   135   163   181   235   227   269   313   348   348   396   461
May     121   125   172   183   229   234   270   318   355   363   420   472
Jun     135   149   178   218   243   264   315   374   422   435   472   535
Jul     148   170   199   230   264   302   364   413   465   491   548   622
Aug     148   170   199   242   272   293   347   405   467   505   559   606
Sep     136   158   184   209   237   259   312   355   404   404   463   508
Oct     119   133   162   191   211   229   274   306   347   359   407   461
Nov     104   114   146   172   180   203   237   271   305   310   362   390
Dec     118   140   166   194   201   229   278   306   336   337   405   432

### <span style='color:Blue'> **Question - 7.Load any one dataset from seaborn & Show how to use pivot table function .** </span>

In [21]:
flights = sns.load_dataset('flights')

# Display a few rows of the original dataset
print("Original Flights Dataset:")
print(flights.head())

# Use the pivot_table function to pivot and aggregate the dataset
pivot_table_result = pd.pivot_table(flights, values='passengers', index='month', columns='year', aggfunc='sum')


print("\nPivot Table Result (Total Passengers):")
print(pivot_table_result)

Original Flights Dataset:
   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

Pivot Table Result (Total Passengers):
year   1949  1950  1951  1952  1953  1954  1955  1956  1957  1958  1959  1960
month
Jan     112   115   145   171   196   204   242   284   315   340   360   417
Feb     118   126   150   180   196   188   233   277   301   318   342   391
Mar     132   141   178   193   236   235   267   317   356   362   406   419
Apr     129   135   163   181   235   227   269   313   348   348   396   461
May     121   125   172   183   229   234   270   318   355   363   420   472
Jun     135   149   178   218   243   264   315   374   422   435   472   535
Jul     148   170   199   230   264   302   364   413   465   491   548   622
Aug     148   170   199   242   272   293   347   405   467   505   559   606
Sep     136   158   184   209   237   259   312   355   404   404   463   508
Oct     119   133   162   191   211   229   274   306   347   359   407   461
Nov     104   114   146   172   180   203   237   271   305   310   362   390
Dec     118   140   166   194   201   229   278   306   336   337   405   432

<a id="Crosstab"></a>
## <span style='color:Brown'> **6. Crosstab** </span>

### <span style='color:Blue'> **Question - 8.Write a code & show how to use crosstab function.** </span>

In [22]:
#write observation and code here
import pandas as pd

# Create a sample DataFrame
data = {'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],'Age Group': ['Young', 'Young', 'Adult', 'Adult', 'Senior'],'Count': [10, 15, 20, 12, 8]}

df = pd.DataFrame(data)
cross_tabulation = pd.crosstab(df['Gender'], df['Age Group'], values=df['Count'], aggfunc='sum', margins=True, margins_name='Total')
print(cross_tabulation)

Age Group  Adult  Senior  Young  Total
Gender
Female      12.0     NaN   15.0     27
Male        20.0     8.0   10.0     38
Total       32.0     8.0   25.0     65

<a id="Datetime_module"></a>
## <span style='color:Brown'> **7. Datetime_module** </span>

### <span style='color:Blue'> **Question - 9.Display the current date & time.** </span>

In [25]:
#write observation and code here
import datetime


current_datetime = datetime.datetime.now()
print("Current Date and Time:", current_datetime)

Current Date and Time: 2023-10-04 21:33:12.118886

### <span style='color:Blue'> **Question - 10.Write a programme to create a range of date & then convert it into DataFrame.** </span>

In [26]:
#write observation and code here
import pandas as pd
import datetime


start_date = datetime.date(2023, 1, 1)
end_date = datetime.date(2023, 1, 10)
date_range = [start_date + datetime.timedelta(days=x) for x in range((end_date - start_date).days + 1)]


df = pd.DataFrame({'Date': date_range})

print(df)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10

# The End